# ALL ABOUT PANDAS LIBRARY OF PYTHON

In [ ]:
'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples'

In [10]:
import pandas as a
import numpy as np

In [11]:
read1=a.read_csv('C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv')
read1.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
read1=a.read_csv('C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv',header=None)
read1.head()

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [15]:
read1=a.read_csv('C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv',names=['a','b','c','word'])
read1.head()                                                                                                                              ## name parameter is used to set the own header

    a   b   c     word
a   b   c   d  message
1   2   3   4    hello
5   6   7   8    world
9  10  11  12      foo

In [43]:
read1=a.read_csv('C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv',names=['a','b','c','d','word'])
read1

   a   b   c   d     word
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [16]:
read1=a.read_csv('C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv')
type(read1)

pandas.core.frame.DataFrame

In [3]:
read1=a.read_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\ex1.csv')
read1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [40]:
read1=a.read_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\ex1.csv')
a.isnull(read1)

       a      b      c      d  message
0  False  False  False  False    False
1  False  False  False  False    False
2  False  False  False  False    False

In [41]:
read1=a.read_csv('C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv',names=['a','b','c','d','word','g'])
read1

   a   b   c   d     word   g
0  a   b   c   d  message NaN
1  1   2   3   4    hello NaN
2  5   6   7   8    world NaN
3  9  10  11  12      foo NaN

In [42]:
read1=a.read_csv('C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv',names=['a','b','c','d','word','g'])
read1
a.isnull(read1)

       a      b      c      d   word     g
0  False  False  False  False  False  True
1  False  False  False  False  False  True
2  False  False  False  False  False  True
3  False  False  False  False  False  True

In [17]:
read1=a.read_csv('C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv',names=['a','b','c','d','word','g'])
read1

   a   b   c   d     word   g
0  a   b   c   d  message NaN
1  1   2   3   4    hello NaN
2  5   6   7   8    world NaN
3  9  10  11  12      foo NaN

In [18]:
read1=a.read_csv('C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv',names=['a','b','c','d','word','g'],na_values=['null'])
read1

   a   b   c   d     word   g
0  a   b   c   d  message NaN
1  1   2   3   4    hello NaN
2  5   6   7   8    world NaN
3  9  10  11  12      foo NaN

In [54]:
read1=a.read_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\ex4.csv')
read1

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [52]:
read1=a.read_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\ex4.csv',skiprows=[0,2,3])
read1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
## read1=a.read_excel(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\ex1.xlsx')
read1

In [19]:
read1=a.read_excel(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\ex1.xlsx', sheet_name='Sheet3')
read1

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\GULAM ALI KHAN\\Documents\\ML for deployment\\Notebook\\Chp 5 Data analysis\\data for pandas\\examples\\ex1.xlsx'

In [64]:
read1=a.read_html("http://www.basketball-reference.com/leagues/NBA_2015_totals.html")
read1

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

In [66]:
read1=a.read_html("http://www.basketball-reference.com/leagues/NBA_2015_totals.html")
read1[0].ix[:,0:20]

C:\Users\GULAM ALI KHAN\Anaconda32\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

C:\Users\GULAM ALI KHAN\Anaconda32\lib\site-packages\pandas\core\indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,3P,3PA,3P%,2P,2PA,2P%,eFG%,FT,FTA
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,.459,18,60,.300,134,271,.494,.486,76,97
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,.407,10,25,.400,25,61,.410,.465,14,23
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,.544,0,2,.000,217,397,.547,.544,103,205
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,.432,0,0,NaN,19,44,.432,.432,22,38
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,.424,118,333,.354,257,551,.466,.491,167,198
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,.466,38,115,.330,413,853,.484,.486,131,200
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,.451,19,65,.292,270,576,.469,.466,88,129
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,.495,19,50,.380,143,277,.516,.524,43,71
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,.461,1,1,1.000,171,372,.460,.462,127,164
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,.549,0,0,NaN,340,619,.549,.549,153,186

In [10]:
read1=a.read_html("http://www.basketball-reference.com/leagues/NBA_2015_totals.html")
read1[0].ix[:,0:20].head(10)

C:\Users\GULAM ALI KHAN\Anaconda32\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,3P,3PA,3P%,2P,2PA,2P%,eFG%,FT,FTA
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,.459,18,60,.300,134,271,.494,.486,76,97
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,.407,10,25,.400,25,61,.410,.465,14,23
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,.544,0,2,.000,217,397,.547,.544,103,205
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,.432,0,0,NaN,19,44,.432,.432,22,38
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,.424,118,333,.354,257,551,.466,.491,167,198
5,5,Arron Afflalo,SG,29,DEN,53,53,1750,281,657,.428,82,243,.337,199,414,.481,.490,127,151
6,5,Arron Afflalo,SG,29,POR,25,19,752,94,227,.414,36,90,.400,58,137,.423,.493,40,47
7,6,Alexis Ajina,C,26,NOP,68,8,957,181,329,.550,0,0,NaN,181,329,.550,.550,81,99
8,7,Furkan Aldemir,PF,23,PHI,41,9,540,40,78,.513,0,5,.000,40,73,.548,.513,13,27
9,8,Cole Aldrich,C,26,NYK,61,16,976,144,301,.478,0,0,NaN,144,301,.478,.478,50,64

In [20]:
read1=a.read_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\ex1.csv', nrows=2)
read1                                                                                                                                 ## nrow perform same operation as head()

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

In [21]:
read1.to_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\gul11.csv')

In [23]:
import sys
read1.to_csv(sys.stdout, sep="|")  ## stored data at my console

|a|b|c|d|message
0|1|2|3|4|hello
1|5|6|7|8|world

In [22]:
read1.to_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\gul12.csv',sep='#')

In [24]:
read1.to_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\gul13.csv',header=False,index=False)

                                                                                                                                     ## stored the header and index data bcz of header and index parameter

In [25]:
read1.to_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\gul14.csv',index=False,columns=['b','c','d'])

                                                                                                                                                  ## here i gives my own header(column) in gul14 file while data storing

In [7]:
read1=a.read_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\ex1.csv')
read1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
read1.dtypes      ## show data type of each column of given dataframe

a           int64
b           int64
c           int64
d           int64
message    object
dtype: object

In [36]:
read1.dtypes=='object'

a          False
b          False
c          False
d          False
message     True
dtype: bool

In [37]:
read1.dtypes[read1.dtypes=='object']

message    object
dtype: object

In [38]:
read1.dtypes[read1.dtypes=='object'].index

Index(['message'], dtype='object')

In [46]:
z=read1.dtypes[read1.dtypes=='object'].index
z
read1[z]

  message
0   hello
1   world
2     foo

In [48]:
z=read1.dtypes[read1.dtypes=='object'].index
z
read1[z].describe()    #describe statics function      ## in the o/p frequency means no. of occurances

       message
count        3
unique       3
top      hello
freq         1

In [26]:
read1.describe() #describe() method pick only numerical data not categorical data

              a         b         c         d
count  2.000000  2.000000  2.000000  2.000000
mean   3.000000  4.000000  5.000000  6.000000
std    2.828427  2.828427  2.828427  2.828427
min    1.000000  2.000000  3.000000  4.000000
25%    2.000000  3.000000  4.000000  5.000000
50%    3.000000  4.000000  5.000000  6.000000
75%    4.000000  5.000000  6.000000  7.000000
max    5.000000  6.000000  7.000000  8.000000

In [14]:
read1.columns

Index(['a', 'b', 'c', 'd', 'message'], dtype='object')

In [19]:
read1["msg"]="khan" #creating new columns with data khan
read1

   a   b   c   d message   msg
0  1   2   3   4   hello  khan
1  5   6   7   8   world  khan
2  9  10  11  12     foo  khan

In [43]:
read1["d"][0:2]    ## perform operation like head() function

0    4
1    8
Name: d, dtype: int64

In [44]:
abc=a.Categorical(read1['d']) #converting integer into categorical
abc

[4, 8]
Categories (2, int64): [4, 8]

In [47]:
abc=a.Categorical(read1['d'])
c=abc.rename_categories([0,1])  # temporery changing the value of categories 
c

[0, 1]
Categories (2, int64): [0, 1]

In [48]:
read1['d']=c    #permanent changed d column
read1

   a  b  c  d message
0  1  2  3  0   hello
1  5  6  7  1   world

In [49]:
read1['d']

0    0
1    1
Name: d, dtype: category
Categories (2, int64): [0, 1]

In [34]:
read1['c'].unique()  #return unique value from column

array([ 3,  7, 11], dtype=int64)

In [37]:
con_str=read1['d'].astype(str) # converting entire column into string
con_str

0     4
1     8
2    12
Name: d, dtype: object

In [8]:
con_str=read1['c'].astype(str) # converting entire column into string
con_str

0     3
1     7
2    11
Name: c, dtype: object

In [50]:
first_value=[cabin[0] for cabin in read1['message']] ## pick first character from string like (data comprehension)
first_value

['h', 'w']

In [42]:
read1[['message']]

  message
0   hello
1   world

In [30]:
read1['message','d']   #confused between series and dataframe
                       #thats why error is generated

KeyError: ('message', 'd')

In [53]:
read1[['message','d']]

  message   d
0   hello   4
1   world   8
2     foo  12

In [52]:
read1[['message','d']][0:2] #list slice

  message  d
0   hello  4
1   world  8

In [18]:
read1[['message','d']].head(2)

  message  d
0   hello  4
1   world  8

In [31]:
type(read1[['message','d']])

pandas.core.frame.DataFrame

In [21]:
dir 'C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/ex1.csv'

SyntaxError: invalid syntax (<ipython-input-21-0cdec2a6958e>, line 1)

In [22]:
read1=a.read_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\gul13.csv')
read1

      b     c     d
0   2.0   3.0   4.0
1   6.0   7.0   8.0
2  10.0  11.0  12.0
3   NaN   5.0  20.0
4  12.0   NaN  54.0
5   1.0   NaN   NaN

In [38]:
read1.dtypes

b    float64
c    float64
d    float64
dtype: object

In [39]:
read1['b'].astype(str)

0     2.0
1     6.0
2    10.0
3     nan
4    12.0
5     1.0
Name: b, dtype: object

In [40]:
read1.dtypes

b    float64
c    float64
d    float64
dtype: object

In [25]:
read1['c'].isnull()

0    False
1    False
2    False
3    False
4     True
5     True
Name: c, dtype: bool

In [29]:
bc=np.where(read1['c'].isnull() == True)   #where function always return index value
bc

(array([4, 5], dtype=int64),)

In [32]:
np.where(read1['d']==max(read1['d']))

(array([4], dtype=int64),)

In [34]:
read1.iloc[np.where(read1['d']==max(read1['d']))]   #iloc means integer location

      b   c     d
4  12.0 NaN  54.0

In [44]:
read1['b+d']=read1['b']+read1['d']
read1['b+d']
larg_family=np.where(read1['b+d']==max(read1['b+d']))
larg_family

(array([4], dtype=int64),)

In [45]:
read1.iloc[larg_family]

      b   c     d   b+d
4  12.0 NaN  54.0  66.0

In [49]:
read1['b-d']=read1['b']-read1['d']
read1['b-d']
larg_family=np.where(read1['b-d']==max(read1['b-d']))
larg_family

(array([0, 1, 2], dtype=int64),)

In [47]:
read1.iloc[larg_family]

      b     c     d   b+d  b-d
0   2.0   3.0   4.0   6.0 -2.0
1   6.0   7.0   8.0  14.0 -2.0
2  10.0  11.0  12.0  22.0 -2.0

In [54]:
lst1=[1,2,3]
lst=[10,20,30]
arr=np.array(lst)  #converting list into array
print(arr)
a.Series(lst,index=lst1)  #converting list into series

[10 20 30]

1    10
2    20
3    30
dtype: int64

In [69]:
print("conversion between array into series\n", '_' *35)   #converting from array into series
a.Series(arr)

conversion between array into series
 ___________________________________

0    10
1    20
2    30
dtype: int32

In [68]:
print("conversion between array into series\n", '_' *35)   #converting from array into series
a.Series(arr[0])

conversion between array into series
 ___________________________________

0    10
dtype: int64

In [72]:
dic={'a':'gulam','b':'khan','c':20}
dic.items

In [81]:
print("conversion between dictionary into series\n", '_' *35)   #converting from dictionary into series
print(a.Series([type,max,sum,dic.keys(),dic.values(),dic.items()]))

conversion between dictionary into series
 ___________________________________
0                      <class 'type'>
1             <built-in function max>
2             <built-in function sum>
3                           (a, b, c)
4                   (gulam, khan, 20)
5    ((a, gulam), (b, khan), (c, 20))
dtype: object

In [27]:
ser1=a.Series([1,2,3,4],['a','b','c','d'])
ser2=a.Series([1,2,3,4,5],['a','b','c','d','e'])
print(ser1)
print(ser2)

a    1
b    2
c    3
d    4
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
dates=a.date_range('15/07/1999',periods=10)
abc=a.Series(np.arange(10),index=dates)
#abc.to_csv(r'C:\Users\GULAM ALI KHAN\Documents\ML for deployment\Notebook\Chp 5 Data analysis\data for pandas\examples\gul21.csv')
abc

1999-07-15    0
1999-07-16    1
1999-07-17    2
1999-07-18    3
1999-07-19    4
1999-07-20    5
1999-07-21    6
1999-07-22    7
1999-07-23    8
1999-07-24    9
Freq: D, dtype: int32

In [34]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [3]:
import json
result=json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [5]:
import json
result=json.loads(obj)
type(result)

dict

In [4]:
pqr=json.dumps(result)

In [14]:
pq=a.DataFrame(result['siblings'],columns=['name','age']) #converting dictionary into table ie dataframe
pq

    name  age
0  Scott   30
1  Katie   38

In [13]:
pq=a.DataFrame(result['siblings'],columns=['name','age','pets'])
pq

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [28]:
js=a.read_json("C:/Users/GULAM ALI KHAN/Documents/ML for deployment/Notebook/Chp 5 Data analysis/data for pandas/examples/example.json")
js

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [30]:
print(js.to_json())    ## store the above data on console in json format
print(js.to_json(orient="records"))    ## store the above data on console in json format

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [35]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'    ## reading data of web API
resp = requests.get(url)
resp

In [37]:
data = resp.json()
data[0]['user']    ## aftar performing filter on 'data'

{'login': 'jorisvandenbossche',
 'id': 1020496,
 'node_id': 'MDQ6VXNlcjEwMjA0OTY=',
 'avatar_url': 'https://avatars2.githubusercontent.com/u/1020496?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/jorisvandenbossche',
 'html_url': 'https://github.com/jorisvandenbossche',
 'followers_url': 'https://api.github.com/users/jorisvandenbossche/followers',
 'following_url': 'https://api.github.com/users/jorisvandenbossche/following{/other_user}',
 'gists_url': 'https://api.github.com/users/jorisvandenbossche/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/jorisvandenbossche/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/jorisvandenbossche/subscriptions',
 'organizations_url': 'https://api.github.com/users/jorisvandenbossche/orgs',
 'repos_url': 'https://api.github.com/users/jorisvandenbossche/repos',
 'events_url': 'https://api.github.com/users/jorisvandenbossche/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/jorisvandenbossche/received_events',
 'type': 'User',
 'site_admin': False}

In [39]:
issues = a.DataFrame(data, columns=['number', 'title','labels', 'state']) ## converting json data into dataframe
issues

,number,title,labels,state
0,33261,PERF: masked ops for reductions (min/max),"[{'id': 1817503692, 'node_id': 'MDU6TGFiZWwxOD...",open
1,33260,DOC: Fixed examples in `pandas/core/accessor.py`,[],open
2,33259,DOC: Added an example for each series.dt field...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
3,33256,REGR: DataFrame.mean(numeric_only=True) raises...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
4,33255,BUG: Cant access some `TimedeltaProperties` co...,[],open
5,33254,API: EA interface - strictness of _from_sequence,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
6,33253,BUG: BooleanArray.any with all False values an...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,33252,INT: provide helpers for accessing the values ...,[],open
8,33251,"Pandas, using matplot displays an incorrect ye...",[],open
9,33250,Display Timedelta nanoseconds,[],open
10,33249,REF: dispatch DatetimeBlock.to_native_types to...,[],open
11,33248,REF: do slicing before calling Block.to_native...,[],open
12,33247,BUG: Fix droped result column in groupby with ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,33246,BLD: recursive inclusion of DLLs in package data,[],open
14,33245,BUG: Categorical.values_for_(factorize|argsort...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
15,33244,CLN: Clean nanops.get_corr_func,[],open
16,33242,agg behaviour depends on the number of argumen...,[],open
17,33240,CLN: remove Block.merge,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
18,33239,"Unable to Build pandas with Py38, macOS (clang...","[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
19,33237,"Warning ""Try using .loc[row_indexer,col_indexe...","[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
20,33236,ENH: provide standard BaseIndexers in pandas.a...,[],open
21,33235,TST: Use try/except block to properly catch an...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
22,33234,Groupby multiple columns causes agg to have pr...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
23,33233,Ods loses spaces 32207,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
24,33232,merge() outer with left_on column and right_in...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,33231,REF: put concatenate_block_managers in interna...,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
26,33230,DOC: Fixed examples in `pandas/core/groupby/`,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
27,33229,REF: sql insert_data operate column-wise to av...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
28,33224,compatibility issues with master branch cython,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
29,33220,ENH: Add year for week of year,"[{'id': 219960758, 'node_id': 'MDU6TGFiZWwyMTk...",open

In [40]:
S1=a.Series([1,2,3,4],['CA','OR','CO','CA'])
S2=a.Series([5,6,7,8],['CA','NV','AZ','OR'])
S3=S1+S2
S3

AZ     NaN
CA     6.0
CA     9.0
CO     NaN
NV     NaN
OR    10.0
dtype: float64

In [7]:
print('the idea work even for multiplication...\n','_'*45,sep='')
print(S1*S2)

the idea work even for multiplication...
_____________________________________________
AZ     NaN
CA     5.0
CA    20.0
CO     NaN
NV     NaN
OR    16.0
dtype: float64

In [11]:
matrix_data=rn(4,5)  #generate random value

matrix_data

array([[-0.79544744,  1.54368462, -1.07162538, -0.14041136,  1.0260699 ],
       [-0.84318672, -0.45423404, -1.17114634, -0.7420505 ,  2.33278557],
       [ 2.87622703,  0.69563753,  0.75675327,  0.02026709, -0.12830562],
       [ 0.30850004,  0.02900123, -0.67790767,  0.14851086, -0.14485021]])

In [1]:
import pandas as a
from numpy.random import randn as rn
matrix_data=rn(4,5)
row_index=['A','B','C','D']
column_value=['P','Q','R','S','T']
s=a.DataFrame(matrix_data,row_index,column_value)
s

          P         Q         R         S         T
A -0.628975  1.020324 -2.793876 -1.017951  0.196844
B  1.293558 -0.147361 -1.220819  1.136473 -1.411629
C  0.177066 -0.387076 -0.112418 -0.414416 -0.007251
D  0.142477  1.667417  0.861684  1.131341 -0.827577

In [3]:
s.iloc[2]

P    0.177066
Q   -0.387076
R   -0.112418
S   -0.414416
T   -0.007251
Name: C, dtype: float64

In [6]:
s.loc['B']

P   -1.136321
Q    0.101573
R   -1.111866
S    1.088585
T   -2.260703
Name: B, dtype: float64

In [7]:
s[['P','R','T']]

          P         R         T
A -0.009154  0.001830  1.165048
B -1.136321 -1.111866 -2.260703
C  0.769938  0.614922  1.678530
D  1.580480  0.117713  0.270781

In [8]:
s['P+R']=s['P']+s['R']
s['P+R']

A   -0.007324
B   -2.248187
C    1.384860
D    1.698194
Name: P+R, dtype: float64

In [9]:
s

          P         Q         R         S         T       P+R
A -0.009154  0.416967  0.001830 -0.192795  1.165048 -0.007324
B -1.136321  0.101573 -1.111866  1.088585 -2.260703 -2.248187
C  0.769938  0.458829  0.614922 -1.613289  1.678530  1.384860
D  1.580480 -1.164107  0.117713  0.310127  0.270781  1.698194

In [10]:
s.drop('D')  #delete D row  tempareroly

          P         Q         R         S         T       P+R
A -0.009154  0.416967  0.001830 -0.192795  1.165048 -0.007324
B -1.136321  0.101573 -1.111866  1.088585 -2.260703 -2.248187
C  0.769938  0.458829  0.614922 -1.613289  1.678530  1.384860

In [11]:
s.drop('P+R',axis=1)   #drop column P+R  temprerorly

          P         Q         R         S         T
A -0.009154  0.416967  0.001830 -0.192795  1.165048
B -1.136321  0.101573 -1.111866  1.088585 -2.260703
C  0.769938  0.458829  0.614922 -1.613289  1.678530
D  1.580480 -1.164107  0.117713  0.310127  0.270781

In [12]:
s.drop('T',axis=1,inplace=True)  #delete column T permanently

In [13]:
s

          P         Q         R         S       P+R
A -0.009154  0.416967  0.001830 -0.192795 -0.007324
B -1.136321  0.101573 -1.111866  1.088585 -2.248187
C  0.769938  0.458829  0.614922 -1.613289  1.384860
D  1.580480 -1.164107  0.117713  0.310127  1.698194

In [39]:
s.drop(inplace=False)    #It doesn't delete entire DataFrame

ValueError: Need to specify at least one of 'labels', 'index' or 'columns'

In [3]:
from numpy.random import randn as rn
matrix_data=rn(4,5)
row_index=['A','B','C','D']
column_value=['P','Q','R','S','T']
g=a.DataFrame(data=matrix_data,index=row_index,columns=column_value)
g

          P         Q         R         S         T
A  0.937757 -1.017673  0.137830  0.844496  0.354355
B -0.220397  0.369379  0.056094  0.022055 -0.189280
C -0.062486  1.212555  0.885511  1.400342 -1.725778
D -1.566905 -0.136703  1.112248 -0.504179 -0.593365

In [15]:
g.loc[['B','C']]    #pick value from B,C rows with all column

          P         Q         R         S         T
B  0.308589 -0.732729 -1.205653 -0.433129  2.758642
C -0.748421 -1.353421 -0.404822  0.659778 -1.120157

In [16]:
g.loc[['B','C'],['Q','T']]   #pick value from B,C rows with Q,T column

          Q         T
B -0.732729  2.758642
C -1.353421 -1.120157

In [17]:
p=g.loc[['B','C'],['Q','T']]
p.loc[['B'],['Q']]

          Q
B -0.732729

In [18]:
g.iloc[[0,2,3],[0,3,4]]      #pick value from A,C,D rows with P,S,T column

          P         S         T
A -0.648855 -0.301131 -0.573680
C -0.748421  0.659778 -1.120157
D  1.308012 -0.930886 -1.321749

In [25]:
g.iloc[:,[0,3,4]]  #all rows and P,S,T column

          P         S         T
A -0.648855 -0.301131 -0.573680
B  0.308589 -0.433129  2.758642
C -0.748421  0.659778 -1.120157
D  1.308012 -0.930886 -1.321749

In [26]:
print('\n')
g.loc[['B','C'],['Q','T']]>0      #returns boolean value

       Q      T
B  False   True
C  False  False

In [28]:
g

          P         Q         R         S         T
A -0.648855 -0.404581 -0.530255 -0.301131 -0.573680
B  0.308589 -0.732729 -1.205653 -0.433129  2.758642
C -0.748421 -1.353421 -0.404822  0.659778 -1.120157
D  1.308012  0.585645  0.896458 -0.930886 -1.321749

In [30]:
g[g>0]

          P         Q         R         S         T
A       NaN       NaN       NaN       NaN       NaN
B  0.308589       NaN       NaN       NaN  2.758642
C       NaN       NaN       NaN  0.659778       NaN
D  1.308012  0.585645  0.896458       NaN       NaN

In [34]:
g.loc[['B'],['T']]=5   #change value of particular cell

In [37]:
g

          P         Q         R         S         T
A -0.648855 -0.404581 -0.530255 -0.301131 -0.573680
B  0.308589 -0.732729 -1.205653 -0.433129  5.000000
C  0.345000  0.345000  0.345000  0.345000  0.345000
D  1.308012  0.585645  0.896458 -0.930886 -1.321749

In [36]:
g.loc[['C']]=0.345   #change value of particular row

In [42]:
import numpy as np
data1=np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')  #creating array
row_index=['A','B','C','D','E']
column_value=['height','weight','age']
g=a.DataFrame(data=data1,index=row_index,columns=column_value)
g

   height  weight  age
A      22      66  140
B      42      70  148
C      30      62  125
D      35      68  160
E      25      62  152

In [43]:
n=a.DataFrame(data=data1)
n

    0   1    2
0  22  66  140
1  42  70  148
2  30  62  125
3  35  68  160
4  25  62  152

In [44]:
g

   height  weight  age
A      22      66  140
B      42      70  148
C      30      62  125
D      35      68  160
E      25      62  152

In [45]:
 g[g['age']>148]     #display all the data where age is greate than 148.

   height  weight  age
D      35      68  160
E      25      62  152

In [46]:
 g['age']>148    #it returns boolean value of age column

A    False
B    False
C    False
D     True
E     True
Name: age, dtype: bool

In [50]:
bool1=g['height']>30
bool2=g['weight']>66

In [51]:
bool3=g[(bool1) & (bool2)]
bool3

   height  weight  age
B      42      70  148
D      35      68  160

In [52]:
g[bool1]

   height  weight  age
B      42      70  148
D      35      68  160

In [54]:
g[bool1][['height','weight']]  #pick only height and weight from all columns

   height  weight
B      42      70
D      35      68

In [57]:
g.reset_index()   #reset the indexes of dataframe

  index  height  weight  age
0     A      22      66  140
1     B      42      70  148
2     C      30      62  125
3     D      35      68  160
4     E      25      62  152

In [58]:
g.reset_index(drop=True)   #drop arg help to remove previous index

   height  weight  age
0      22      66  140
1      42      70  148
2      30      62  125
3      35      68  160
4      25      62  152

   height  weight  age
A      22      66  140
B      42      70  148
C      30      62  125
D      35      68  160
E      25      62  152

In [65]:
'doctor engineer CA DataSci clusterEngg'.split()    #split fun divide the string based on space into list

['doctor', 'engineer', 'DataSci', 'clusterEngg']

In [66]:
g['profession']='doctor engineer CA DataSci clusterEngg'.split()

In [67]:
g

   height  weight  age   profession
A      22      66  140       doctor
B      42      70  148     engineer
C      30      62  125           CA
D      35      68  160      DataSci
E      25      62  152  clusterEngg

In [69]:
g.set_index('profession')    #set the profession column as index

             height  weight  age
profession
doctor           22      66  140
engineer         42      70  148
CA               30      62  125
DataSci          35      68  160
clusterEngg      25      62  152

In [5]:
#multi indexes
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3,]
mul_index=list(zip(outside,inside))  #zip fun help to mapping the list of similar indexes into tupleprint
mul_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [6]:
print(mul_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [8]:
a.MultiIndex.from_tuples(mul_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [10]:
mul_index=a.MultiIndex.from_tuples(mul_index)
mul_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [12]:
c=a.MultiIndex.from_tuples(mul_index)
c

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [19]:
mul=a.DataFrame(data=rn(6,3),index=c)
mul

             0         1         2
G1 1  0.478167 -1.484674  0.754178
   2 -2.126153 -0.063754  1.336754
   3  1.609526  1.382329  0.839063
G2 1 -1.838922  0.327264  0.474701
   2  1.319405  0.184595 -0.658448
   3 -1.485136 -0.229203  0.438733

In [21]:
multi=a.DataFrame(data=rn(6,3),index=c,columns=['A','B','C'])
multi

             A         B         C
G1 1  0.618551  1.476746  0.673495
   2  0.113170 -0.167619  1.326541
   3 -0.660252 -0.376088  0.829246
G2 1 -1.298406 -0.298134 -1.240246
   2  0.951881 -0.179882  0.249925
   3 -0.407622 -1.176784 -0.154646

In [28]:
multi.loc['G1']

          A         B         C
1  0.618551  1.476746  0.673495
2  0.113170 -0.167619  1.326541
3 -0.660252 -0.376088  0.829246

In [30]:
multi.loc['G1'].loc[1]

A    0.618551
B    1.476746
C    0.673495
Name: 1, dtype: float64

In [25]:
multi.loc['G1'].iloc[1]   #value changed bcz iloc takes original index

A    0.113170
B   -0.167619
C    1.326541
Name: 2, dtype: float64

In [31]:
multi.loc['G1'].loc[1]['C']  #returns specific cell

0.6734950911482722

In [33]:
multi

             A         B         C
G1 1  0.618551  1.476746  0.673495
   2  0.113170 -0.167619  1.326541
   3 -0.660252 -0.376088  0.829246
G2 1 -1.298406 -0.298134 -1.240246
   2  0.951881 -0.179882  0.249925
   3 -0.407622 -1.176784 -0.154646

In [32]:
multi.xs('G2')   #returns cross section (rows and column) from data dataframe
                 #it works like loc fun

          A         B         C
1 -1.298406 -0.298134 -1.240246
2  0.951881 -0.179882  0.249925
3 -0.407622 -1.176784 -0.154646

In [34]:
multi.ix[1,2]

C:\Users\GULAM ALI KHAN\Anaconda32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\GULAM ALI KHAN\Anaconda32\lib\site-packages\pandas\core\indexing.py:961: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  return getattr(section, self.name)[new_key]

1.3265408506683734